import gensim
import gensim.models.doc2vec
from gensim.summarization import summarize

#documents = gensim.models.doc2vec.TaggedLineDocument('result2.txt')
#loading the model
model_loaded = gensim.models.doc2vec.Doc2Vec.load('my_model_sents_from_res2.doc2vec')

#sample Text
text = '''
زبان فارسی از شاخهٔ هندواروپایی زیرشاخهٔ هندوایرانی و دستهٔ زبان‌های ایرانی است. پیشینهٔ کهن زبان فارسی به ایران باستان بازمی‌گردد. روند تاریخی زبان فارسی را به سه دوره باستان، میانی و نو بخش می‌کنند. زبان فارسی امروزی ریشه در فارسی میانه دارد و فارسی میانه ریشه در فارسی باستان.[۳۶][۳۷][۳۸][۳۹] و فارسی تنها زبان ایرانی است که هر سه دوره تاریخی آن ثبت شده و از آنها نوشتارهایی به‌جا مانده‌است.

بر اثر این روندها، زبان پارتی در همان دوره پیش از اسلام از خراسان بزرگ رخت بربست و جای خود را به فارسی (میانه) داد و عرب‌ها پس از حمله به ایران زبان فارسی دری را به عنوان زبان تماس با مردم محل برگزیدند و سربازان حملات اسلامی به شرق همین زبان فارسی دری را با خود در مناطق دوردست‌تری در آسیای میانه گسترش دادند.[۳۲]
 '''

print (summarize(text))